Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_DevelopiOSAppsSwift/DevelopiOSAppsSwift-level2.tmx
Source language: en_us
Languages: ja

source: This provides space between the stack view and the edge of the scene.
ja: これは、スタックビューとこのシーンの端の間の空白を提供します。

source: This replaces the current cell with a new cell that contains the updated meal data.
ja: これは、現在のセルを更新されたmealデータを含む新しいセルで置き換えます。

source: This returns an optional.
ja: これはオプショナルを返します。

source: This sets the title for the table view controller’s navigation item.
ja: これは、テーブルビューコントローラの持つナビゲーション項目に対してタイトルを設定します。

source: This setting causes Interface Builder to draw a blue bounding box around all the views in the canvas.
ja: この設定は、Interface Builderにキャンバスの中のすべてのビューの周りに青い境界ボックスを描画させます。

source: This simplifies the switch statement’s logic, since you won’t need to deal with optionals inside the cases.
ja: これは、switch文の論理を簡単なものにします、あなたはケース節内のオプショナルを解決する必要があるからです。

source: This style of app design where view controllers serve as the communication pipeline between your views and your data model is known as MVC (Model-View-Controller).
ja: ビューコントローラがあなたのビューとあなたのデータモデルの間で通信の輸送菅としての役目をするこの形式のアプリ設計は、MVC（モデル-ビュー-コントローラ）として知られます。

source: This table describes the changes to Start Developing iOS Apps (Swift).
ja: この表は、iOSアプリの開発を始める（Swift）への変更を記述します。

source: This tells the layout engine to create constraints that define the view’s size and position based on the view’s frame and autoresizingmask properties.
ja: これは、レイアウトエンジンに制約を作成するように言い、それはビューの大きさと位置をビューのframeとautoresizingmaskプロパティに基づいて定義します。

source: This tells the stack view that it should no longer calculate the button’s size and position—but the button is still a subview of the stack view.
ja: これは、スタックビューにそれはもはやボタンの大きさと位置を計算すべきでないことを伝えます — しかしボタンはまだスタックビューのサブビューの１つです。

source: This time you should be able to click the image view to pull up an image picker.
ja: 今度は、あなたはイメージビューをクリックしてイメージピッカーをプルアップできなければなりません。

source: This time, however, the text field extends past the screen’s right edge.
ja: 今度は、しかしながら、テキスト欄は画面の右端を越えて伸びています。

source: This value is only used while designing your interface in Interface Builder; at runtime, the layout engine uses the view’s actual intrinsic content size instead.
ja: この値は、あなたのインターフェイスをInterface Builderにおいて設計している間に使われることができるだけです；実行時には、レイアウトエンジンはそのビューの持つ実際の固有コンテンツサイズを代わりに使います。

source: This view controller will manage the view that displays the list of meals, and have a reference to the data model behind what’s shown in the user interface.
ja: このビューコントローラは、食事リストを表示するビューを管理します、そしてユーザインターフェイスにおいて見せられるものの背後にあるデータモデルへの参照を持ちます。

source: This way, when you need to use the key in multiple places throughout your code, you can use the constant instead of retyping the string (which increases the likelihood of mistakes).
ja: こうすることで、あなたのコードにおいて複数の箇所でキーを使う必要がある時、あなたはその文字列をなんどもタイプする（間違いの可能性を増やす）ことの代わりに定数を使うことができます。

source: This will correct the position of every view in the scene, based on their current constraints.
ja: これは、シーン中の全てのビューの位置を、それらの現在の制約に基づいて訂正します。

source: This will help you track the app’s flow if you have to debug your code.
ja: これは、あなたがあなたのコードをデバッグしなければならないならば、あなたがアプリのフローを追跡する助けとなります。

source: This window represents the root of your app’s view hierarchy.
ja: このウインドウは、あなたのアプリのビュー階層のルートを表します。

source: This work is done by the UIApplicationMain attribute (@UIApplicationMain), which appears toward the top of the file.
ja: この仕事は、UIApplicationMain属性（@UIApplicationMain）によって行われます、それはファイルの一番上の方に現れます。

source: Those buttons aren’t linked to any actions yet, so you can click them, but they don’t do anything.
ja: それらのボタンは、まだどんなアクションとも結び付けられません、それであなたはそららをクリックできますが、それらは何もしません。

source: Throwing a fatal error here terminates the app and prints a useful error message to the console, helping you find and fix any problems while you design and test your app.
ja: ここでの致命的なエラーのスローは、アプリを終了して役に立つエラーメッセージをコンソールに出力して、あなたがあなたのアプリを設計してテストする間あなたが何らかの問題を見つけて修正する助けとなります。

source: To accomplish this, you’ll use an unwind segue.
ja: これを成し遂げるために、あなたは巻き戻しセグエを使います。

source: To add Auto Layout constraints to the meal scene
ja: 「自動レイアウト」制約を食事シーンに加えるには

source: To add a Meal property to MealViewController
ja: MealプロパティをMealViewControllerに加えるには

source: To add a button to your scene
ja: ボタンをあなたのシーンに加えるには

source: To add a label to your scene
ja: あなたのシーンにラベルを加えるには

source: To add a navigation controller to the meal detail scene
ja: ナビゲーションコントローラ食事詳細シーンに加えるには

source: To add a navigation controller to your meal list scene
ja: ナビゲーションコントローラをあなたの食事リストシーンに加えるには

source: To add a new item, hover over the last item in the property list, and click on the add button when it appears (or select Editor > Add Item).
ja: 新しい項目を加えるには、プロパティリストの最後の項目上でマウスカーソルを動かして、追加ボタンをそれが現れたらクリックしてください（またはEditor > Add Itemを選択してください）。

source: To add a new meal or edit an existing one, users navigate to a different screen where they can specify a name, rating, and photo for a particular meal.
ja: 新しい食事を加えたり既存のものを編集するために、ユーザは異なる画面に進んでいきます、そこで彼らは名前、レーティング、そして写真を特定の食事に対して指定します。

source: To add a photo library usage description
ja: フォトライブラリ使用説明を加えるには

source: To add a scene with a table view to your storyboard
ja: テーブルビューを持つシーンをあなたのストーリーボードに追加するには

source: To add a tap gesture recognizer to your image view
ja: タップジェスチャリコグナイザをあなたのイメージビューに加えるには

source: To add a text field to your scene
ja: テキスト欄をあなたのシーンに加えるには

source: To add accessibility labels, values, and hints
ja: アクセシビリティ・ラベル、値、およびヒントを加えるには

source: To add an Edit button to the table view
ja: Editボタンをテーブルビューに加えるには

source: To add an action method to MealTableViewController
ja: アクションメソッドをMealTableViewControllerに加えるには

source: To add an action to the button
ja: アクションをボタンに加えるには

source: To add an image to your project
ja: 画像をあなたのプロジェクトに加えるには

source: To add an image view to your scene
ja: イメージビューをあなたのシーンに加えるには

source: To add images to iOS Simulator
ja: iOSシミュレータに画像を加えるには

source: To add images to your project
ja: いくらかの画像をあなたのプロジェクトに加えるには

source: To add inspectable properties
ja: 調査可能なプロパティを加えるには

source: To add rating properties
ja: 格付けプロパティを加えるには

source: To address this uncertainty, you can write unit tests.
ja: この不確実性に取り組むために、あなたはユニットテストを書くことができます。

source: To adjust the text field width within the stack
ja: テキスト欄の幅をスタック内部で調整するには

source: To adopt Auto Layout, wrap your existing interface elements in a stack view, and then add the constraints needed to position the stack view in the scene.
ja: 「自動レイアウト」を採用するには、あなたの既存のインターフェイス要素を１つのスタックビューの中に包んでから、シーンの中でそのスタックビューが位置するのに必要とされる制約を加えてください。

source: To adopt the UIImagePickerControllerDelegate and UINavigationControllerDelegate protocols
ja: UIImagePickerControllerDelegateとUINavigationControllerDelegateプロトコルに準拠するには

source: To adopt the UITextFieldDelegate protocol
ja: UITextFieldDelegateプロトコルを採用するには

source: To attempt to cast an object to one of its subclass types.
ja: あるオブジェクトをそれのサブクラス型の１つと見なす試み。

source: To be able to determine when this happens, add the Save button as an outlet in MealViewController.swift.
ja: それが起こった時を判定可能にするには、SaveボタンをアウトレットとしてMealViewController.swiftに加えます。

source: To be able to encode and decode itself and its properties, the Meal class needs to conform to the NSCoding protocol.
ja: それ自身とそれのプロパティを符号化および復号化するのが可能であるには、MealクラスはNSCodingプロトコルに準拠する必要があります。

source: To be able to rate a meal, users need a control that lets them select the number of stars they want to assign to the meal.
ja: 食事に格付けできるようにするために、ユーザに必要なのはあるコントロールです、それは彼らがその食事に付けたい星の数を選ばせます。

source: To begin designing the user interface (UI), interaction, and behavior of this control, start by creating a custom stack view (UIStackView) subclass.
ja: 設計をユーザインターフェイス (UI)、相互作用、そしてこのコントロールの挙動に対して始めるには、あるカスタムスタックビュー（UIStackView）サブクラスを作成することで始めます。

source: To build and run your app, use the iOS Simulator app that’s included in Xcode.
ja: あなたのアプリをビルドして実行するには、iOS Simulatorアプリを使ってください、それはXcodeに含まれます。

source: To change the implementation of the cancel action
ja: キャンセルアクションの実装を変更するには

source: To change the segue style
ja: セグエの形式を変更するには

source: To clean up the UI
ja: UIを掃除するには

source: To clean up the code
ja: コードを掃除するには

source: To clean up unused pieces of the project
ja: プロジェクトの使用されない部分を掃除するには

source: To clear out the old buttons, add the following code to the beginning of the setupButtons() method.
ja: 古いボタンを処分するには、以下のコードをsetupButtons()メソッドの始まりに加えます。

source: To collapse the console, use the Debug area toggle.
ja: コンソールを折り畳むためには、Debug区画切り替えボタンを使ってください。

source: To configure a custom cell for your table view
ja: カスタムセルをあなたのテーブルビューに対して構成するには

source: To configure and display cells in your table view
ja: セルを構成してあなたのテーブルビューで表示するには

source: To configure the Add button in the meal detail scene
ja: 追加ボタンを食事詳細シーンにおいて構成するには

source: To configure the navigation bar in the meal detail scene
ja: ナビゲーションバーを食事詳細シーンにおいて構成するには

source: To configure the navigation bar in the meal list
ja: ナビゲーションバーを食事リストにおいて構成するには

source: To configure the table view
ja: テーブルビューを設定し構成するには

source: To configure the table view cell
ja: テーブルビューセルを構成するには

source: To configure the text field’s keyboard
ja: このテキスト欄のキーボードを設定するには

source: To configure the text field’s placeholder text
ja: テキスト欄のプレースホルダテキストを設定するには

source: To conform to NSCoding, the Meal needs to subclass NSObject.
ja: NSCodingに準拠するために、MealはNSObjectのサブクラスになる必要があります。

source: To connect a rating control outlet to ViewController.swift
ja: 格付けコントロールアウトレットをViewController.swiftに接続するには

source: To connect the Save button to the MealViewController code
ja: SaveボタンをMealViewControllerコードに接続するには

source: To connect the gesture recognizer to the ViewController.swift code
ja: ジェスチャリコグナイザをViewController.swiftコードに接続するには

source: To connect the image view to the ViewController.swift code
ja: イメージビューをViewController.swiftコードに接続するには

source: To connect the label to the ViewController.swift code
ja: ラベルをViewController.swiftコードに接続するには

source: To connect the text field to the ViewController.swift code
ja: テキスト欄をViewController.swiftコードと接続するには

source: To connect the views to the MealTableViewCell.swift code
ja: ビューをMealTableViewCell.swiftコードに接続するには

source: To create a button in your view
ja: ボタンをあなたのビューの中に作成するには

source: To create a file path to data
ja: データへのファイルパスを作成するには

source: To create a new data model class
ja: 新しいデータモデルを作成するには

source: To create a new project
ja: 新規プロジェクトを作成するには

source: To create a setDefaultLabelText action in the ViewController.swift code
ja: setDefaultLabelTextアクションをViewController.swiftコードの中に作成するには

source: To create a subclass of UIStackView
ja: UIStackViewのサブクラスを作成するには

source: To create a subclass of UITableViewCell
ja: UITableViewCellのサブクラスを作成するには

source: To create a subclass of UITableViewController
ja: UITableViewControllerのサブクラスを作成するには

source: To create a test case, create a method whose name starts with the word test.
ja: あるテスト項目を作成するには、名前が単語testで始まるメソッドを作成してください。

source: To create a total of five buttons
ja: 合計５つのボタンを作成するには

source: To create a total of five buttons, use a for-in loop.
ja: 合計５つのボタンを作成するために、for-inループを使ってください。

source: To create an adaptive interface, you’ll need to specify how the interface should adjust to different screen sizes.
ja: 適応インターフェイスを作成するには、あなたはどのようにインターフェイスが異なる画面サイズに適応すべきかを指定する必要があるでしょう。

source: To create an outlet, Control-drag from a particular object in your storyboard to a view controller file.
ja: アウトレットを作成するには、あなたのストーリーボードの特定のオブジェクトからビューコントローラファイルへとコントロール-ドラッグします。

source: To create and implement a cancel action method
ja: キャンセルアクションメソッドを作成して実装するには

source: To declare the control as @IBDesignable
ja: コントロールを@IBDesignableとして宣言するには

source: To define a data model for a meal
ja: データモデルを食事に対して定義するには

source: To define interaction in your app, your view controller source code needs to be able to communicate with the views in your storyboard.
ja: あなたのアプリにおける相互作用を定義するために、あなたのビューコントローラ・ソースコードは、あなたのストーリーボードの中のビューと通信可能にされる必要があります。

source: To define the behavior of something in code.
ja: ある物の挙動をコードにおいて定義する。

source: To delete a meal
ja: ある食事を削除するには

source: To design the interface of the custom table cell
ja: カスタムテーブルセルのインターフェイスを設計するには

source: To develop iOS apps using the latest technologies described in these lessons, you need a Mac computer (macOS 10.11.5 or later) running the latest version of Xcode.
ja: これらのレッスンにおいて解説される最新のテクノロジーを使ってiOSアプリを開発するために、あなたはXcodeの最新版が動作するMacコンピュータ（OS X 10.11.5以降）を必要とします。

source: To disable the Save button when there’s no item name
ja: Saveボタンを項目名がない時は使用不可能にするには

source: To display a default image in the image view
ja: 初期画像をイメージビューで表示するには

source: To display a section in your table view
ja: セクションをあなたのテーブルビューにおいて表示するには

source: To display any real data in your table cells, you need to write code to load that data.
ja: 何らかの実際のデータをあなたのテーブルセルに表示するために、あなたが必要とするのはコードを書いてそのデータをロードすることです。

source: To display dynamic data, a table view needs two important helpers: a data source and a delegate.
ja: 動的データを表示するために、テーブルビューは２つの重要な手助け：データソースと委任先を必要します。

source: To display the view
ja: ビューを表示するには

source: To display your custom control, you need to add a stack view to your storyboard and establish a connection between the stack view and the code you just wrote.
ja: あなたのカスタムコントロールを画面表示するには、あなたはあるスタックビューをあなたのストーリーボードに加えて、連結をスタックビューとあなたがちょうど書いたコードとの間に確立する必要があります。

source: To do so, you define a simple class with a name, a photo, and a rating.
ja: そうするために、あなたはある簡単なクラスを名前、写真、そして格付けを使って定義します。

source: To do that, add a property observer to each property.
ja: それをするために、プロパティオブザーバを各プロパティに加えてください。

source: To do this, add a private method, setupButtons(), and call that method from both initializers.
ja: これを行うには、プライベートメソッド、setupButtons()を加えて、そのメソッドを両方のイニシャライザが呼び出してください。

source: To download the latest version of Xcode
ja: 最新版のXcodeをダウンロードするには

source: To extract an underlying value from an optional.
ja: 裏に潜んだ値をオプショナルから引き出すためのもの。

source: To fix the error
ja: このエラーを修正するには

source: To fix this, open Main.storyboard and select the RatingControl stack view.
ja: これを修正するために、Main.storyboardを開いてRatingControlスタックビューを選択してください。

source: To fix this, you define the control as @IBDesignable.
ja: これを修正するために、あなたはコントロールを@IBDesignableとして定義します。

source: To fix this, you need to lay out the cell using nested stack views and Auto Layout constraints; however, that is left as an exercise for the reader.
ja: これを修正するには、あなたはセルを入れ子にされたスタックビューと「自動レイアウト」制約を使ってレイアウトする必要があります；しかしながら、それは読者に練習として残されます。

source: To give the meal detail scene a navigation bar when presented modally, embed it in its own navigation controller.
ja: モーダル表示の時に食事詳細シーンにナビゲーションバーを与えるために、それをそれ自身のナビゲーションコントローラに埋め込んでください。

source: To give users the ability to select a picture, you’ll need to implement two of the delegate methods defined in UIImagePickerControllerDelegate:
ja: ユーザに図像を選ぶ能力を与えるために、あなたが実装する必要があるのはUIImagePickerControllerDelegateにおいて定義した委任先メソッド２つです：

source: To help you identify and fix any bugs, if the initializer does fail, the fatalError() function prints the error message to the console and the app terminates.
ja: あなたがバグを同定して修正するのを助けるため、イニシャライザが失敗するならば、fatalError()関数がエラーメッセージをコンソールに出力してアプリを終了します。

source: To help you understand how to define interaction between elements in the user interface, you’ll configure this label to display the text the user enters into the text field.
ja: どうやってユーザインターフェイスにおける要素間の相互作用を定義するかをあなたが理解する助けとして、あなたはこのラベルをユーザがテキストフィールドに入力するテキストを表示するように構成設定します。

source: To identify which segue is occurring
ja: どのセグエが生じているかを識別するには

source: To implement a coding key structure
ja: 符号化キー構造体を実装するには

source: To implement the UITextFieldDelegate protocol method textFieldDidEndEditing(_:)
ja: UITextFieldDelegateのプロトコルメソッドのtextFieldDidEndEditing(_:)を実装するには

source: To implement the UITextFieldDelegate protocol method textFieldShouldReturn(_:)
ja: UITextFieldDelegateのプロトコルメソッドのtextFieldShouldReturn(_:)を実装するには

source: To implement the encodeWithCoder NSCoding method
ja: encodeWithCoder NSCodingメソッドを実装するには

source: To implement the imagePickerController(_:didFinishPickingMediaWithInfo:) method
ja: imagePickerController(_:didFinishPickingMediaWithInfo:)メソッドを実装するには

source: To implement the imagePickerControllerDidCancel(_:) method
ja: imagePickerControllerDidCancel(_:)メソッドを実装するには

source: To implement the initializer to load the meal
ja: 食事をロードするイニシャライザを実装するには

source: To implement the label reset action in the ViewController code
ja: ラベルリセットアクションをViewControllerコードの中に実装するには

source: To implement the method to load the meal list
ja: 食事リストをロードするメソッドを実装するには

source: To implement the method to save the meal list
ja: 食事リストを保存するメソッドを実装するには

source: To implement the prepare(for:sender:) method on MealViewController
ja: prepare(for:sender:)メソッドをMealViewController上で実装するには

source: To implement the rating action
ja: 格付けアクションを実装するには

source: To implement the selectImageFromPhotoLibrary(_:) action method
ja: selectImageFromPhotoLibrary(_:)アクションメソッドを実装するには

source: To indicate that a class, structure, or enumeration conforms to a protocol.
ja: あるクラス、構造体、または列挙がプロトコルに準拠することを示します。

source: To keep things simple, you’ll update the mealNameLabel object’s text value whenever the user enters text into the text field and taps Return.
ja: 物事を単純に保つため、あなたはmealNameLabelオブジェクトの持つtext値を、ユーザがテキストをテキスト欄に入力してReturnをタップするごとに更新するでしょう。

source: To keep things simple, you’ll use the original, unedited image for the meal photo.
ja: 物事を単純に保つために、あなたはオリジナル、食事写真の無編集画像を使います。

source: To link the Save button to the unwindToMealList action method
ja: SaveボタンをunwindToMealListアクションメソッドに接続するには

source: To load the initial data
ja: 初期データをロードするには

source: To load the meal list at the appropriate time
ja: 食事リストを適切な時にロードするには

source: To look at the AppDelegate.swift source file
ja: AppDelegate.swiftソースファイルを見るには

source: To look at the unit test file for FoodTracker
ja: FoodTrackerのためのユニットテストファイルを見つけるには

source: To make it clear which coding key corresponds to each piece of data, create a structure to store the key strings.
ja: どの符号化キーがデータ片のそれぞれに対応するかわかりやすくするために、ある構造体を作成してキー文字列を格納してください。

source: To make this code work for your app, you’ll need to change the identifier to the prototype cell identifier you set in the storyboard (MealTableViewCell), and then add code to configure the cell.
ja: このコードがあなたのアプリのために働くようにするには、あなたはこの識別子をあなたがストーリーボード（MealTableViewCell）で設定した原型セル識別子に変えて、それからセルを構成設定するコードを加える必要があるでしょう。

source: To open your storyboard
ja: あなたのストーリーボードを開くには

source: To override or extend that behavior, you override the methods defined on UIViewController.
ja: その挙動をオーバーライドしたり拡張したりするために、あなたはUIViewControllerで定義されるメソッドをオーバーライドします。

source: To override the initializers
ja: これらイニシャライザをオーバーライドするには

source: To perform any sort of editing on a table view, you need to implement one of its delegate methods, tableView(_:commit:forRowAt:).
ja: 何らかの種類の編集をテーブルビュー上で行うために、あなたが必要とするのは、それの委任先メソッドの１つ、tableView(_:commit:forRowAt:)を実装することです。

source: To perform repeatedly.
ja: 繰り返して実行するようにする。

source: To point the Table View Controller to MealTableViewController.swift
ja: テーブルビューコントローラをMealTableViewController.swiftの方に向けるには

source: To preview a different screen size, click the Add button at the bottom of the assistant editor, and select iPhone SE.
ja: 異なる画面サイズをプレビューするには、Addボタンをアシスタントエディタの一番下でクリックして、iPhone SEを選んでください。

source: To preview the landscape orientation, click the Rotate button at the bottom of the preview.
ja: 水平方向でプレビューするには、Rotateボタンをプレビューの一番下でクリックしてください。

source: To preview your interface
ja: あなたのインターフェイスをプレビューするには

source: To remove the autogenerated constraints, set the translatesAutoresizingMaskIntoConstraints property to false.
ja: 自動生成された制約を取り除くために、translatesAutoresizingMaskIntoConstraintsプロパティをfalseに設定してください。

source: To rename the ViewController.swift file
ja: ViewController.swiftファイルを改名するには

source: To replace an implementation of a method defined on a superclass.
ja: スーパークラス上で定義されるあるメソッドの実装を置き換える。

source: To return the number of rows in your table view
ja: あなたのテーブルビューの中の行の数を返すには

source: To run your app in the simulator
ja: あなたのアプリをシミュレータで実行するには

source: To save the meal list when a user adds, removes, or edits a meal
ja: ユーザが食事を追加、削除、または編集したとき食事リストを保存するには

source: To see the completed sample project for this lesson, download the file and view it in Xcode.
ja: このレッスンの完成見本プロジェクトを見るには、このファイルをダウンロードしてXcodeでそれを見てください。

source: To set star images for the buttons
ja: 星画像をボタンに設定するには

source: To set the ViewController object as the delegate of its nameTextField property
ja: ViewControllerオブジェクトをそれのnameTextFieldプロパティの委任先として設定するには

source: To set the meal list as the initial scene
ja: 食事リストを最初のシーンとして設定するには

source: To subclass NSObject and conform to NSCoding
ja: NSObjectのサブクラスにして、NSCodingに準拠するには

source: To understand when these methods get called and what they need to do, it’s important to know how text fields respond to user events.
ja: 何時これらのメソッドが呼ばれるか、何をそれらは実行に必要とするのかを理解するために、重要となるのは、どうやってテキスト欄がユーザイベントに応答するのかを知ることです。

source: To update an existing meal, you’ll need to modify the unwindToMealList(sender:) action method to handle the two different cases: adding a new meal and editing an existing one.
ja: 既存の食事を更新するには、あなたはunwindToMealList(sender:)アクションメソッドを修正して２つの異なる事例：新しい食事の追加および既存のものの編集、を取り扱う必要があります。

source: To update the control, you need to reset the control’s buttons every time these attributes change.
ja: コントロールを更新するには、あなたはコントロールの持つボタンをそれら属性を変えるたびごとに再設定する必要があります。

source: To update the implementation of unwindToMealList(sender:) to both add and edit meals
ja: unwindToMealList(sender:)の実装を更新して食事の追加も編集も更新するには

source: To update the implementation of viewDidLoad
ja: viewDidLoadの実装を更新するには

source: To view the outline view
ja: アウトラインビューで眺めるには

source: To write a unit test for Meal object initialization
ja: ユニットテストをMealオブジェクト初期化に対して書くには

source: Together, these lines define the button as a fixed-size object in your layout (44 point x 44 point).
ja: 合わせて、これらの行はボタンをあなたのレイアウトの中の規定サイズオブジェクト（44ポイント × 44ポイント）として定義します。

source: Transitions between scenes are called segues.
ja: シーン間の転換はセグエ（遷移。切れ目なく続くこと）と呼ばれます。

source: Try changing the Star Size and Star Count attributes.
ja: Star SizeとStar Count属性の変更を試みてください。

source: Try to use these versions while working on the tutorials.
ja: これらのバージョンをチュートリアルに取り組む間は使うようにしてください。

source: Try typing the second line instead of just copying and pasting.
ja: ２番目の行をコピーアンドペーストするのではなくタイプすることを試みてください。

source: Type 0 in the left and right boxes, and type 20 spacing in the top box.
ja: 0を左と右のボックスでタイプしてください、そして20の間隔を上部ボックスでタイプしてください。

source: Type 0 in the right box.
ja: 左のボックスで0をタイプします。

source: Type 320 in both the Width and Height fields.
ja: 320をWidth（幅）とHeight（高さ）欄にタイプします。

source: Type New Meal and press Return to save.
ja: New Mealをタイプしてからリターンキーを押し保存してください。

source: Type Your Meals and press Return.
ja: Your MealsをタイプしてReturnを押してください。

source: Typically buttons respond to the .touchUpInside event.
ja: 一般的にボタンは.touchUpInsideイベントに応答します。

source: Typically, iOS calls viewDidLoad() only once, when its content view is first created; however, the content view is not necessarily created when the controller is first instantiated.
ja: 通常は、iOSはviewDidLoad()をただ一度だけ、、それが最初に作成される時に呼び出します；しかしながら、コンテンツビューは必ずしもコントローラが最初にインスタンス化される時に作成されるわけではありません。

source: Typically, when you are using Auto Layout, you want to replace these autogenerated constraints with your own.
ja: 一般的に、あなたが自動レイアウトを使っている場合、あなたはこれら自動生成される制約をあなた独自のものと置き換えたいでしょう。

source: Under the comment, add the following method:
ja: コメントの下で、以下のメソッドを加えてください：

source: Under the comment, add the following:
ja: このコメントの下で、以下を加えてください：

source: Understand how to create views programmatically
ja: どのようにビューを作成するかプログラム的に理解する

source: Understand the View Controller Lifecycle
ja: ビューコントローラのライフサイクルを理解する

source: Understand the delegation pattern
ja: デリゲートパターンの理解

source: Understand the difference between static properties and instance properties
ja: 静的プロパティとインスタンスプロパティの間の違いを理解する

source: Understand the key components of a table view
ja: テーブルビューの鍵となる部分を理解する

source: Understand the roles of table view delegates and data sources
ja: テーブルビュー委任先とデータソースの役割を理解する
